%m241.m           由输入向量的范围构建线性神经网络            
clear all;
close all;

%---1.构建2输入、单输出线性神经元
net=newlin([-2 2;-2 2],1)   ;%设PR=[ ; ],S=1
w0=net.iw{1,1}               %观测构建的神经元的权值、阈值
b0=net.b{1}                        
u=[1;2]                     ;%神经元输入
y10=sim(net,u),pause         %观测输出 
net.iw{1,1}=[-1 0.5]        ;%设权值、阈值
net.b{1}=[-0.4];
y11=sim(net,u),pause         %改变权系值观测输出

%---2.构建2输入、2输出线性神经网络
net=newlin([-2 2;-2 2],2)   ;%PR=[ ; ],S=2
w20=net.iw{1,1}              %观测权值、阈值
b20=net.b{1}               
u2=[-1;1]                   ;%设神经元输入
y20=sim(net,u2),pause        %观测输出
net.b{1}=[-0.6;0.2]         ;%设阈值
y21=sim(net,u2),pause        %改变阈值，观测输出
